In [73]:
import pandas as pd
import numpy as np

In [74]:
a = {
    "name" : ["Akbar", "Arslan", "Danial"],
    "city" : ["Hyd" , "Jamshoro", "Karachi"],
    "profession" : ["Python Developer", "Web Developer", "Ai Engineer"]
}

b = pd.DataFrame(a)

In [75]:
b

     name      city        profession
0   Akbar       Hyd  Python Developer
1  Arslan  Jamshoro     Web Developer
2  Danial   Karachi       Ai Engineer

In [76]:
b["gender"] = ["Male", "Male", "Male"]

In [77]:
b

     name      city        profession gender
0   Akbar       Hyd  Python Developer   Male
1  Arslan  Jamshoro     Web Developer   Male
2  Danial   Karachi       Ai Engineer   Male

In [78]:
a = {
    "name" : ["Akbar", "Arslan", "Danial"],
    "Obtain Marks" : [400 , 345, 450],
    "Total Marks" : [500, 500, 500]
}

c = pd.DataFrame(a)

In [79]:
c

     name  Obtain Marks  Total Marks
0   Akbar           400          500
1  Arslan           345          500
2  Danial           450          500

In [80]:
a = [1, 7, 2]

myvar = pd.Series(a)

myvar

0    1
1    7
2    2
dtype: int64

In [81]:
c

     name  Obtain Marks  Total Marks
0   Akbar           400          500
1  Arslan           345          500
2  Danial           450          500

In [82]:
c["percentage"] = [400/500*100, 345/500*100, 450/500*100]
c["grade"] = ["A", "B", "A+"]

c

     name  Obtain Marks  Total Marks  percentage grade
0   Akbar           400          500        80.0     A
1  Arslan           345          500        69.0     B
2  Danial           450          500        90.0    A+

In [83]:
c["percentage"]

0    80.0
1    69.0
2    90.0
Name: percentage, dtype: float64

In [84]:
c[c["percentage"] > 70]

     name  Obtain Marks  Total Marks  percentage grade
0   Akbar           400          500        80.0     A
2  Danial           450          500        90.0    A+

In [85]:
c["grade"]

0     A
1     B
2    A+
Name: grade, dtype: object

In [86]:
c[c["grade"] == "A+"]

     name  Obtain Marks  Total Marks  percentage grade
2  Danial           450          500        90.0    A+

In [87]:
c.head(2)

     name  Obtain Marks  Total Marks  percentage grade
0   Akbar           400          500        80.0     A
1  Arslan           345          500        69.0     B

In [88]:
c.tail(2)

     name  Obtain Marks  Total Marks  percentage grade
1  Arslan           345          500        69.0     B
2  Danial           450          500        90.0    A+

In [89]:
c.loc[1]

name            Arslan
Obtain Marks       345
Total Marks        500
percentage        69.0
grade                B
Name: 1, dtype: object

In [90]:
c.to_csv("dataset.csv")

In [91]:
df = pd.read_csv("dataset.csv")

In [92]:
df

   Unnamed: 0    name  Obtain Marks  Total Marks  percentage grade
0           0   Akbar           400          500        80.0     A
1           1  Arslan           345          500        69.0     B
2           2  Danial           450          500        90.0    A+

In [99]:
df.drop(columns=["Unnamed: 0"], inplace=True)

In [100]:
df

     name  Obtain Marks  Total Marks  percentage grade
0   Akbar           400          500        80.0     A
1  Arslan           345          500        69.0     B
2  Danial           450          500        90.0    A+

In [101]:
data = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [102]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q